cmsis-svd/cmsis-svd/data/Atmel/ATSAMV70J19.svd
            <register>
               <name>RTC_CALALR</name>
               <description>Calendar Alarm Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MONTH</name>
                     <description>Month Alarm</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>MTHEN</name>
                     <description>Month Alarm Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATE</name>
                     <description>Date Alarm</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DATEEN</name>
                     <description>Date Alarm Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_SR</name>
               <description>Status Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ACKUPD</name>
                     <description>Acknowledge for Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACKUPDSelect</name>
                        <enumeratedValue>
                           <name>FREERUN</name>
                           <description>Time and calendar registers cannot be updated.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE</name>
                           <description>Time and calendar registers can be updated.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ALARM</name>
                     <description>Alarm Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ALARMSelect</name>
                        <enumeratedValue>
                           <name>NO_ALARMEVENT</name>
                           <description>No alarm matching condition occurred.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARMEVENT</name>
                           <description>An alarm matching condition has occurred.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEC</name>
                     <description>Second Event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SECSelect</name>
                        <enumeratedValue>
                           <name>NO_SECEVENT</name>
                           <description>No second event has occurred since the last clear.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SECEVENT</name>
                           <description>At least one second event has occurred since the last clear.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIMEV</name>
                     <description>Time Event</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TIMEVSelect</name>
                        <enumeratedValue>
                           <name>NO_TIMEVENT</name>
                           <description>No time event has occurred since the last clear.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIMEVENT</name>
                           <description>At least one time event has occurred since the last clear.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CALEV</name>
                     <description>Calendar Event</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CALEVSelect</name>
                        <enumeratedValue>
                           <name>NO_CALEVENT</name>
                           <description>No calendar event has occurred since the last clear.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CALEVENT</name>
                           <description>At least one calendar event has occurred since the last clear.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDERR</name>
                     <description>Time and/or Date Free Running Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TDERRSelect</name>
                        <enumeratedValue>
                           <name>CORRECT</name>
                           <description>The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERR_TIMEDATE</name>
                           <description>The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_SCCR</name>
               <description>Status Clear Command Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ACKCLR</name>
                     <description>Acknowledge Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALRCLR</name>
                     <description>Alarm Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECCLR</name>
                     <description>Second Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMCLR</name>
                     <description>Time Clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALCLR</name>
                     <description>Calendar Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDERRCLR</name>
                     <description>Time and/or Date Free Running Error Clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ACKEN</name>
                     <description>Acknowledge Update Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALREN</name>
                     <description>Alarm Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECEN</name>
                     <description>Second Event Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEN</name>
                     <description>Time Event Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALEN</name>
                     <description>Calendar Event Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDERREN</name>
                     <description>Time and/or Date Error Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ACKDIS</name>
                     <description>Acknowledge Update Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALRDIS</name>
                     <description>Alarm Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECDIS</name>
                     <description>Second Event Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMDIS</name>
                     <description>Time Event Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALDIS</name>
                     <description>Calendar Event Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDERRDIS</name>
                     <description>Time and/or Date Error Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ACK</name>
                     <description>Acknowledge Update Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALR</name>
                     <description>Alarm Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEC</name>
                     <description>Second Event Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM</name>
                     <description>Time Event Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL</name>
                     <description>Calendar Event Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDERR</name>
                     <description>Time and/or Date Error Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTC_VER</name>
               <description>Valid Entry Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NVTIM</name>
                     <description>Non-valid Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVCAL</name>
                     <description>Non-valid Calendar</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVTIMALR</name>
                     <description>Non-valid Time Alarm</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVCALALR</name>
                     <description>Non-valid Calendar Alarm</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
