cmsis-svd/cmsis-svd/data/Atmel/ATSAMV70J19.svd
            <register>
               <name>DACC_IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXRDY0</name>
                     <description>Transmit Ready Interrupt Mask of channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY1</name>
                     <description>Transmit Ready Interrupt Mask of channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC0</name>
                     <description>End of Conversion Interrupt Mask of channel 0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC1</name>
                     <description>End of Conversion Interrupt Mask of channel 1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACC_ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXRDY0</name>
                     <description>Transmit Ready Interrupt Flag of channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY1</name>
                     <description>Transmit Ready Interrupt Flag of channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC0</name>
                     <description>End of Conversion Interrupt Flag of channel 0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC1</name>
                     <description>End of Conversion Interrupt Flag of channel 1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACC_ACR</name>
               <description>Analog Current Register</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IBCTLCH0</name>
                     <description>Analog Output Current Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IBCTLCH1</name>
                     <description>Analog Output Current Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACC_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protect Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0.</description>
                           <value>0x444143</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACC_WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SCnSCB</name>
         <description>System control not in SCB</description>
         <groupName>SCnSCB</groupName>
         <prependToName>SCnSCB_</prependToName>
         <baseAddress>0xE000E000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ICTR</name>
               <description>Interrupt Controller Type Register</description>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>INTLINESNUM</name>
                     <description>Total number of interrupt lines supported by an implementation, defined in groups of 32</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACTLR</name>
               <description>Auxiliary Control Register</description>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>DISFOLD</name>
                     <description>Disables folding of IT instructions</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPEXCODIS</name>
                     <description>Disables FPU exception outputs</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISRAMODE</name>
                     <description>Disables dynamic read allocate mode for Write-Back Write-Allocate memory regions</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISITMATBFLUSH</name>
                     <description>Disables ITM and DWT ATB flush</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISBTACREAD</name>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISBTACALLOC</name>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCRITAXIRUR</name>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISDI</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DISISSCH1</name>
                     <bitOffset>21</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DISDYNADD</name>
                     <description>Disables dynamic allocation of ADD and SUB instructions</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCRITAXIRUW</name>
                     <description>Disable critical AXI read-under-write</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISFPUISSOPT</name>
                     <description>Disables dynamic allocation of ADD and SUB instructions</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
